'''Известно, что X кг шоколадных конфет стоит A рублей, а Y кг ирисок
стоит B рублей. Определить, сколько стоит 1 кг шоколадных конфет, 1 кг ирисок, а также
во сколько раз шоколадные конфеты дороже ирисок.'''

while True:
    try:
        X = float(input("Введите количество кг шоколадных конфет: "))
        A = float(input("Введите стоимость шоколодных конфет в рублях: "))
        Y = float(input("Введите количество кг ирисок: "))
        B = float(input("Введите стоимость ирисок в рублях: "))

        choco = A / X
        toffee = B / Y

        print(f"1 кг шоколадных конфет: {choco:.2f} руб.")
        print(f"1 кг ирисок: {toffee:.2f} руб.")
        print(f"Шоколадные дороже ирисок в {choco / toffee:.2f} раз(а)")

    except (ValueError, ZeroDivisionError):
        print("Ошибка! Введите числа, не равные нулю.")



